Autodesk.Revit.DB.FabricationConfigurationInfo.AddCached(System.String,System.String)
Adds a fabrication configuration.
name:
The fabrication configuration name.
path:
The path where fabrication configuration located.
Returns:
returns whether the configuration was added successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.GetAllFabricationConfigurationsForProducts(System.Int32,System.Int32)
Gets all added fabrication configurations.
Returns:
All added fabrication configurations.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.Compare(Autodesk.Revit.DB.FabricationConfigurationInfo)
Whether one configuration is the same as another one, or may be compatible if not.
Returns:
return zero for an exact match. Positive values indicate a partial match, with the lower value being closer. Negative values indicate no match.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.FabricationConfigurationInfo.IsEqual(Autodesk.Revit.DB.FabricationConfigurationInfo)
Checks if the two configuration are the same(e.g. if they have the same GUID and version).
fc:
The other FabricationConfigurationInfo object to compare.
Returns:
True if the two configuration are the same.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.CreateCloudConfig(System.String,System.String,System.Guid,System.Double,Autodesk.Revit.DB.UnitSystem,System.String)
constructor of FabricationConfigurationInfo for cloud configurations
Returns:
returns config info for cloud config
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.GetAllFabricationConfigurations
Gets all added fabrication configurations.
Returns:
All added fabrication configurations.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.FindSourceFabricationConfiguration(Autodesk.Revit.DB.FabricationConfigurationInfo)
Finds the source fabrication configuration on disk which matches the input fabrication configuration.
Remarks:
Fabrication configuration is matched by configuration GUID and version. The GUIDs are required to be the same.
For version, we first try to match the version exactly. If Revit cannot find an exact match, then it looks for
the closest version later than the input configuration, then the closest earlier version.
fabricationConfiguration:
The fabrication configuration to match.
Returns:
The matching source fabrication configuration.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.GetProfiles
Return the profiles in the fabrication configuration.
Remarks:
The global profile name is empty, and is not returned here.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.IsValid
Checks if the fabrication configuration is valid.
Returns:
True if the fabrication configuration is valid.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationConfigurationInfo.IsCloudConfiguration
Whether the cloud configuration is a remote cloud one.
Since:
2019

Autodesk.Revit.DB.FabricationConfigurationInfo.Path
The path where the fabrication configuration is located.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.UnitSystem
The unit system of the fabrication configuration. Units can be UnitSystem.Metric or UnitSystem.Imperial.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.Description
The description of the fabrication configuration.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.Version
The version of the fabrication configuration.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.GUID
The unique identification of the fabrication configuration.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.ProductVersion
product version of config (0 is current, else year)
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.IsConnected
whether the remote cloud configuration is connected and can be loaded.
Since:
2019

Autodesk.Revit.DB.FabricationConfigurationInfo.CloudVersion
The cloud cached version index.
Since:
2019

Autodesk.Revit.DB.FabricationConfigurationInfo.CloudId
The identifier of the cloud configuration.
Since:
2019

Autodesk.Revit.DB.FabricationConfigurationInfo.IsLocked
Checks whether the fabrication configuration is locked. If true, the configuration is locked and cannot be removed.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo.Name
The name of the fabrication configuration.
Since:
2016

Autodesk.Revit.DB.FabricationConfigurationInfo
Represents an MEP object that holds the properties of an MEP fabrication configuration.
Since:
2016